Fredoun21/ESP8266_Domoticz_Radiateur_MQTT_WM/src/main.cpp

/**
 *   Projet pilotge de radiateur par fil pilote avec interface web, domoticz, MQTT
 *   ESP8266 + DS12B20 + LED + MQTT + Home-Assistant
 *   Projets DIY (https://www.projetsdiy.fr) - Mai 2016
 *   Licence : MIT
 **/

// Include the libraries we need
// #include <Arduino.h>

#include "../lib/config.h"
#include "../lib/DomoticzConfig.h"

#include <ESP8266WiFi.h> //https://github.com/esp8266/Arduino/tree/master/libraries/ESP8266WiFi
#include <ESP8266mDNS.h> // https://github.com/esp8266/Arduino/tree/master/libraries/ESP8266mDNS
// #include <ESPAsyncTCP.h> // Dependance avec ESPAsyncWebServer.h

#include <WiFiManager.h> //https://github.com/tzapu/WiFiManager
#warning						 // #define WEBSERVER_H Indispensable pour valider la compilation entre WiFiManager.h et ESPAsyncWebServer.h
#define WEBSERVER_H
#include <ESPAsyncWebServer.h> // https://github.com/me-no-dev/ESPAsyncWebServer
// #include <ESP8266WebServer.h>
// #include <WiFiClient.h>
// #include <DNSServer.h>

// this needs to be first, or it all crashes and burns...
#include "FS.h"
#include <LittleFS.h>	  // https://github.com/esp8266/Arduino/tree/master/libraries/LittleFS
#include <ArduinoJson.h>  //https://github.com/bblanchon/ArduinoJson
#include <PubSubClient.h> //https://github.com/knolleary/pubsubclient
#ifdef OTA
#include <ElegantOTA.h> //https://github.com/ayushsharma82/ElegantOTA
#endif

#ifdef ISR_TIMER
#include <ESP8266TimerInterrupt.h> //https://github.com/khoih-prog/ESP8266TimerInterrupt
#include <ESP8266_ISR_Timer.h>	  // https://github.com/khoih-prog/ESP8266TimerInterrupt
#endif

// #include <OneWire.h>
#include <DallasTemperature.h>
#include <Ticker.h>

//----------------------------------------------------------------- PIN SETTINGS
#ifdef LED_BUILTIN
#undef LED_BUILTIN
#define LED_BUILTIN 2
#endif
#define PIN_FILPILOTE_PLUS 12	 // N° de Pin fil pilote
#define PIN_FILPILOTE_MOINS 13 // N° de Pin fil pilote
#define PIN_ACS712 A0			 // Mesure de courant
#define PIN_ONE_WIRE_BUS 14	 // Mesure de température

/*
variable gestion de boucle
*/
const int watchdog = 300000;				  // Fréquence d'envoi des données à Domoticz 5min
unsigned long previousMillis = millis(); // mémoire pour envoi des données
boolean firstLoop = false;
unsigned long i = 0;
volatile uint32_t startMillis = 0; // mesure du temps des interruption timerISR
#ifdef OTA
long ota_progress_millis = 0;
#endif

// Définition PIN DATA du bus oneWire
OneWire oneWire(PIN_ONE_WIRE_BUS);
DallasTemperature DS18B20(&oneWire);

#ifdef ISR_TIMER
// Création tache tempo pour mode confort 1 et 2
ESP8266Timer ITimer;			  // Init ESP8266 timer 1
ESP8266_ISR_Timer ISR_Timer; // Init ESP8266_ISR_Timer
#endif

#ifndef ISR_TIMER
Ticker tickerSetHigh;
Ticker tickerSetLow;
#endif

#ifdef MQTT
// Définissez vos valeurs par défaut ici, s'il existe différentes valeurs dans config.json, elles sont écrasées.
char mqtt_server[40] = MQTT_SERVER;
char mqtt_port[6] = MQTT_PORT;

// Les paramètres supplémentaires à configurer (peuvent être globaux ou simplement dans la configuration)
// Après la connexion, Parameter.GetValue () vous obtiendra la valeur configurée
// ID / nom Principal / longueur de défaut invite
WiFiManagerParameter custom_mqtt_server("server", "mqtt server", mqtt_server, 40);
WiFiManagerParameter custom_mqtt_port("port", "mqtt port", mqtt_port, 6);
#endif

// Création objet WiFiManager
// Intialisation locale.Une fois son entreprise terminée, il n'est pas nécessaire de le garder
WiFiManager wifiManager;

// Création server pour webServer et Elegant OTA
AsyncWebServer server(80);

//----------------------------------------------------------------- MQTT
#ifdef MQTT

WiFiClient espClient;

// flag for saving data
bool shouldSaveConfigMQTT = true;
PubSubClient clientMQTT(espClient);
#endif

unsigned long lastMsg = 0;
#define MSG_BUFFER_SIZE (50)
char msg[MSG_BUFFER_SIZE];
int value = 0;

void callback(char *topic, byte *payload, unsigned int length);
void reconnect(const char *id, const char *topic); // void reconnect();
#ifdef MQTT
void saveConfigCallback();
void askMqttToDomoticz(int idx, String svalue, const char *topic);
void sendMqttToDomoticz(int idx, String svalue, const char *topic);
#endif
void updateFilpilote(int pinPlus, int pinMoins, int svalue, int idx);
void confortSetPin(int aPinHigh, int aPinLow, float aTempoHigh, float aTempoLow);
void setPinConfort(int state);
#ifndef ISR_TIMER
void confortStopTask();
#endif
float retourSensor(DallasTemperature sensor);
float valeurACS712(int pin);
#ifdef OTA
void onOTAStart();
void onOTAProgress(size_t current, size_t final);
void onOTAEnd(bool success);
#endif
#ifdef ISR_TIMER
void IRAM_ATTR TimerHandler();
void doingSomethingConfort1();
void doingSomethingConfort2();
#endif
void printStatus(uint16_t index, unsigned long timerDelay, unsigned long deltaMillis, unsigned long currentMillis);

void setup()
{
	//----------------------------------------------------------------- Serial
	Serial.begin(115200);
	while (!Serial)
	{
	};
	Serial.println("Port Série OK\n");

	Serial.print(F("\nType de carte: "));
	Serial.println(ARDUINO_BOARD);
	Serial.println(ESP8266_TIMER_INTERRUPT_VERSION);
	Serial.print(F("CPU Frequency = "));
	Serial.print(F_CPU / 1000000);
	Serial.println(F(" MHz"));

	//----------------------------------------------------------------- GPIO
	pinMode(PIN_FILPILOTE_PLUS, OUTPUT);
	pinMode(PIN_FILPILOTE_MOINS, OUTPUT);

	// Positionne en mode Hors Gel à la mise sous tension
	digitalWrite(PIN_FILPILOTE_PLUS, HIGH);
	digitalWrite(PIN_FILPILOTE_MOINS, HIGH);

	// Start DS18b20
	DS18B20.begin();

	//----------------------------------------------------------------- SPIFFS

	// LittleFS.format(); // clean FS, for testing

	// Lire la configuration JSON avec LittleFS
	Serial.println("\nmontage LittleFS...\n");

	if (!LittleFS.begin())
	{
		Serial.println("Erreur SPIFFS....\n");
		return;
	}

	FSInfo fs_info; // création structure d’information du système de fichiers LittleFS

	// Lecture et afficage des infos du système de fichiers LittleFS
	LittleFS.info(fs_info);
	Serial.printf("totalBytes: %i octets\n", fs_info.totalBytes);
	Serial.printf("usedBytes: %i octets\n", fs_info.usedBytes);
	Serial.printf("blockSize: %i octets\n", fs_info.blockSize);
	Serial.printf("pageSize: %i octets\n", fs_info.pageSize);
	Serial.printf("maxOpenFiles: %i octets\n", fs_info.maxOpenFiles);
	Serial.printf("maxPathLength: %i octets\n\n", fs_info.maxPathLength);

	// Affiche les fichiers présent en SPIFFS
	File root = LittleFS.open("/", "r");
	File file = root.openNextFile();

	unsigned long totalSize = 0;

	while (file)
	{
		Serial.print("File: ");
		Serial.print(file.name());
		Serial.print(" ");
		Serial.println(file.size());
		totalSize += file.size();
		file.close();
		file = root.openNextFile();
	}

	root.close();
	file.close();
	root = LittleFS.open("/css/", "r");
	file = root.openNextFile();

	while (file)
	{
		Serial.print("File: ");
		Serial.print(file.name());
		Serial.print(" ");
		Serial.println(file.size());
		totalSize += file.size();
		file.close();
		file = root.openNextFile();
	}

	root.close();
	file.close();
	root = LittleFS.open("/script/", "r");
	file = root.openNextFile();

	while (file)
	{
		Serial.print("File: ");
		Serial.print(file.name());
		Serial.print(" ");
		Serial.println(file.size());
		totalSize += file.size();
		file.close();
		file = root.openNextFile();
	}

	Serial.print("\nTotal taille fichiers: ");
	Serial.print(totalSize);
	Serial.println(" octets\n");

	//----------------------------------------------------------------- JSON
#ifdef MQTT
	if (LittleFS.exists("/config.json"))
	{
		// le fichier existe, lecture et chargement
		Serial.println("\nLecture du fichier de configuration");
		File configFile = LittleFS.open("/config.json", "r");

		if (configFile.isFile())
		{
			Serial.println("\nContenu du fichier: ");
			while (configFile.available())
			{
				Serial.write(configFile.read());
			}
			Serial.println("\nOuverture fichier de configuration");
			// Serial.println(configFile.position());
			configFile.seek(0, SeekSet); // Positionne le pointeur dans le fichier à 0
			// Serial.println(configFile.position());
			size_t size = configFile.size();
			Serial.print("Taille du fichier :");
			Serial.print(size);
			Serial.println(" octets");

			if (size > 1024)
			{
				Serial.println("Taille de fichier de configuration trop grande\n");
				return;
			}

			std::unique_ptr<char[]> buf(new char[size]);

			// int tmp = configFile.readBytes(buf.get(), size);
			// Serial.println(tmp);
			// Serial.println(buf.get());

			// Allocate the JSON document
			StaticJsonDocument<1024> doc;

			// Parse JSON object
			auto error = deserializeJson(doc, buf.get());
			if (error)
			{
				Serial.print("\ndeserializeJson() en échec: ");
				Serial.print(error.f_str());
				Serial.print(", ");
				Serial.println(error.code());
				Serial.print("\n");
				// return;
			}
			else
			{
				// Faire une boucle à travers tous les éléments du tableau
				JsonArray repos = doc["mqtt_server"]["mqtt_port"];

				for (JsonObject repo : repos)
				{
					// Imprimez le nom, le nombre d'étoiles et le nombre de problèmes
					Serial.println(repo["mqtt_server"].as<const char *>());
					Serial.println(repo["mqtt_port"].as<const char *>());
					Serial.println(repo["local_host"].as<const char *>());
					Serial.println(repo["mqtt_local_portport"].as<const char *>());
					Serial.println(repo["local_gateway"].as<const char *>());
					Serial.println(repo["local_subnet"].as<const char *>());
				}

				Serial.println("\nparsed doc");
				strcpy(mqtt_server, doc["mqtt_server"]);
				strcpy(mqtt_port, doc["mqtt_port"]);
			}
			configFile.close();
		}
	}
#endif
	// Fin de lecture SPIFFS

	//----------------------------------------------------------------- WIFI
#ifdef MQTT
	// Définir le rappel de notif
	wifiManager.setSaveConfigCallback(saveConfigCallback);

	// Ajoutez tous vos paramètres ici
	wifiManager.addParameter(&custom_mqtt_server);
	wifiManager.addParameter(&custom_mqtt_port);
#endif

	// Définir IP statique
	wifiManager.setSTAStaticIPConfig(IPAddress(LOCAL_IP), IPAddress(LOCAL_GATEWAY), IPAddress(LOCAL_SUBNET));
	// reset settings - for testing
	// wifiManager.resetSettings();

	// définir la qualité minimale du signal afin qu'il ignore les AP sous cette qualité par défaut à 8%
	// wifiManager.setMinimumSignalQuality();

