Fredoun21/ESP8266_Domoticz_Radiateur_MQTT_WM/src/main.cpp
	// Définit le délai d'attente jusqu'à ce que le portail de configuration soit désactivé
	// utile pour que tout se réessaye ou s'endorme en quelques secondes
	wifiManager.setTimeout(120);

	// Rechet SSID et passe et essaie de se connecter
	// s'il ne le connecte pas, il démarre un point d'accès avec le nom spécifié
	// ici "autoconnectap"
	// et entre dans une boucle de blocage en attente de configuration
	if (!wifiManager.autoConnect(NAMEID, WM_PASSWORD))
	{
		Serial.println("wifiManager: problème de connection -> ESP reset");
		delay(3000);
		// reset and try again, or maybe put it to deep sleep
		ESP.reset();
		delay(5000);
	}

	// if you get here you have connected to the WiFi
	Serial.println("\twifiManager: connection...yeey :)\n");
	Serial.print("Carte ESP Address MAC: ");
	Serial.println(WiFi.macAddress());
	Serial.print("Carte ESP Adresse IP: ");
	Serial.println(WiFi.localIP());

//----------------------------------------------------------------- Save Parametres dans CONFIG.JSON
#ifdef MQTT
	// read updated parameters
	strcpy(mqtt_server, custom_mqtt_server.getValue());
	strcpy(mqtt_port, custom_mqtt_port.getValue());
	Serial.println("The values in the file are: ");
	Serial.println("\tmqtt_server : " + String(mqtt_server));
	Serial.println("\tmqtt_port : " + String(mqtt_port));

	// save the custom parameters to LittleFS
	if (shouldSaveConfigMQTT)
	{
		Serial.println("Sauvegarde configuration");
		DynamicJsonDocument doc(1024);

		doc["mqtt_server"] = mqtt_server;
		doc["mqtt_port"] = mqtt_port;

		File configFile = LittleFS.open("/config.json", "w");
		if (!configFile)
		{
			Serial.println("Impossible d'ouvrir le fichier de configuration pour l'écriture");
		}

		serializeJson(doc, Serial);
		serializeJson(doc, configFile);

		configFile.close();
		// end save
	}

	//----------------------------------------------------------------- MQTT
	clientMQTT.setServer(MQTT_SERVER, String(MQTT_PORT).toInt());
	// clientMQTT.setServer(mqtt_server, String(mqtt_port).toInt());
	clientMQTT.setCallback(callback);
#endif

	//----------------------------------------------------------------- Server
	// Envoi la page HTML
	server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
				 { request->send(LittleFS, "/index.html", "text/html"); });

	// Envoi du fichier CSS
	server.on("/css/style.css", HTTP_GET, [](AsyncWebServerRequest *request)
				 { request->send(LittleFS, "/css/style.css", "text/json"); });

	// Envoi du script JS
	server.on("/script/script.js", HTTP_GET, [](AsyncWebServerRequest *request)
				 { request->send(LittleFS, "/script/script.js", "text/json"); });

	// Envoi du script JS
	server.on("/script/gpio.js", HTTP_GET, [](AsyncWebServerRequest *request)
				 { request->send(LittleFS, "/script/gpio.js", "text/json"); });

	// Envoi la page HTML
	server.on("/data.json", HTTP_GET, [](AsyncWebServerRequest *request)
				 { request->send(LittleFS, "/data.json", "text/json"); });

	// // Envoi la page HTML
	// server.on("/lireTemperature", HTTP_GET, [](AsyncWebServerRequest *request)
	// 			 { request->send(200, "test/plain"); });

	server.on("/GET", HTTP_GET, [](AsyncWebServerRequest *request)
				 // List all parameters
				 {
		int params = request->params();
		Serial.println(params);
		for (int i = 0; i < params; i++)
		{
			AsyncWebParameter *p = request->getParam(i);
			if (p->isFile())
			{ // p->isPost() is also true
				Serial.printf("FILE[%s]: %s, size: %u\n", p->name().c_str(), p->value().c_str(), p->size());
			}
			else if (p->isPost())
			{
				Serial.printf("POST[%s]: %s\n", p->name().c_str(), p->value().c_str());
			}
			else
				Serial.printf("GET[%s]: %s\n", p->name().c_str(), p->value().c_str());
		};
		String inputMessage;
		String inputParam;
		// GET input1 value on <ESP_IP>/get?input1=<inputMessage>
		if (request->hasParam("SVALUE1"))
		{
			inputMessage = request->getParam("SVALUE1")->value();
			inputParam = "SVALUE1";
		}

			// Check if GET parameter exists
			if (request->hasParam("SVALUE1"))
			{
				AsyncWebParameter *p2 = request->getParam("SVALUE1");
				Serial.printf("GET[%s]: %s\n", p2->name().c_str(), p2->value().c_str());
			};

			// updateFilpilote(PIN_FILPILOTE_PLUS, PIN_FILPILOTE_MOINS, int(0), 8);
			request->send(200); });

	// Execute la mise à jour du fil pilote
	// server.on("/SVALUE1=0", HTTP_GET, [](AsyncWebServerRequest *request)
	// 			 {
	// 	updateFilpilote(PIN_FILPILOTE_PLUS, PIN_FILPILOTE_MOINS, int(0), 8);
	// 	request->send(200); });

	// Execute la mise à jour du fil pilote
	server.on("/SVALUE1=10", HTTP_GET, [](AsyncWebServerRequest *request)
				 {
		updateFilpilote(PIN_FILPILOTE_PLUS, PIN_FILPILOTE_MOINS, int(10), 8);
		request->send(200); });

	// Execute la mise à jour du fil pilote
	server.on("/SVALUE1=20", HTTP_GET, [](AsyncWebServerRequest *request)
				 {
		updateFilpilote(PIN_FILPILOTE_PLUS, PIN_FILPILOTE_MOINS, int(20), 8);
		request->send(200); });

	// Execute la mise à jour du fil pilote
	server.on("/SVALUE1=30", HTTP_GET, [](AsyncWebServerRequest *request)
				 {
		updateFilpilote(PIN_FILPILOTE_PLUS, PIN_FILPILOTE_MOINS, int(30), 8);
		request->send(200); });

	// Execute la mise à jour du fil pilote
	server.on("/SVALUE1=40", HTTP_GET, [](AsyncWebServerRequest *request)
				 {
		updateFilpilote(PIN_FILPILOTE_PLUS, PIN_FILPILOTE_MOINS, int(40), 8);
		request->send(200); });

	// Execute la mise à jour du fil pilote
	server.on("/SVALUE1=100", HTTP_GET, [](AsyncWebServerRequest *request)
				 {
		updateFilpilote(PIN_FILPILOTE_PLUS, PIN_FILPILOTE_MOINS, int(100), 8);
		request->send(200); });

	//----------------------------------------------------------------- Elegant OTA
#ifdef OTA
	ElegantOTA.begin(&server); // Start ElegantOTA
	// ElegantOTA callbacks
	ElegantOTA.onStart(onOTAStart);
	ElegantOTA.onProgress(onOTAProgress);
	ElegantOTA.onEnd(onOTAEnd);
#endif

	Serial.println("\nHTTP server setup.\nHTTP server started.\nServer ready!\n");
	server.begin();

	//----------------------------------------------------------------- INTERRUPT
	// Interval in microsecs
	if (ITimer.attachInterruptInterval(HW_TIMER_INTERVAL_MS * 1000, TimerHandler))
	{
		startMillis = millis();
		Serial.print(F("Starting ITimer OK, millis() = "));
		Serial.println(startMillis);
	}
	else
		Serial.println(F("Can't set ITimer. Select another freq. or timer"));
}

void loop()
{
	//----------------------------------------------------------------- Elegant OTA
#ifdef OTA
	server.handleClient();
	ElegantOTA.loop();
	delay(500);
#endif

//----------------------------------------------------------------- MQTT
#ifdef MQTT
	// Ne pas oublié de mettre MQTT_MAX_PACKET_SIZE = 2048 dans PubSubClient.h
	if (!clientMQTT.connected())
	{
		Serial.println("reconnection domoticz/out");
		reconnect(MQTT_ID, TOPIC_DOMOTICZ_OUT);
	}
	clientMQTT.loop();

	unsigned long currentMillis = millis();

