Fredoun21/ESP8266_Domoticz_Radiateur_MQTT_WM/src/main.cpp
	// ajout d'un delais de 60s apres chaque trame envoyés pour éviter d'envoyer
	// en permanence des informations à domoticz et de créer des interférences
	if ((currentMillis - previousMillis > watchdog) || firstLoop == LOW)
	{
		previousMillis = currentMillis;
		if (!firstLoop)
		{ // Demande état d'un device
			askMqttToDomoticz(IDXDomoticz, "getdeviceinfo", TOPIC_DOMOTICZ_IN);
			firstLoop = HIGH;
		}

		// Envoi MQTT température du DS18B20
		sendMqttToDomoticz(IDXDS18B20, String(retourSensor(DS18B20)), TOPIC_DOMOTICZ_IN);

		// Envoi MQTT mesure de courant du AC712
		sendMqttToDomoticz(IDXACS712, String(valeurACS712(PIN_ACS712)), TOPIC_DOMOTICZ_IN);
	}
#endif
}

/**
 * callback notifying us of the need to save config
 *
 **/
#ifdef MQTT
void saveConfigCallback()
{
	Serial.println("Devrait enregistrer la configuration");
	shouldSaveConfigMQTT = true;
}

/**
 * MQTT callback
 *
 **/
void callback(char *topic, byte *payload, unsigned int length)
{
	DynamicJsonDocument jsonBuffer(1024);
	String messageReceived = "";

	Serial.print("Message arrive [");
	Serial.print(topic);
	Serial.print("] ");

	// decode payload message
	for (unsigned int i = 0; i < length; i++)
	{
		messageReceived += ((char)payload[i]);
	}
	// display incoming message
	Serial.print("Message recu: ");
	Serial.println(messageReceived);

	// if domoticz message
	if (strcmp(topic, TOPIC_DOMOTICZ_OUT) == 0)
	{
		DeserializationError error = deserializeJson(jsonBuffer, messageReceived);
		if (error)
		{
			Serial.print(F("\nparsing Domoticz/out JSON Received Message failed with code: "));
			Serial.println(error.c_str());
			return;
		}

		int idx = jsonBuffer["idx"];
		int nvalue = jsonBuffer["nvalue"];
		float svalue = jsonBuffer["svalue"];
		float svalue1 = jsonBuffer["svalue1"];
		const char *name = jsonBuffer["name"];

#ifdef DEBUG
		Serial.printf("\nIDX: %i, name: %s, nVALUE: %i, sVALUE: %f, sVALUE1: %i\n", idx, name, nvalue, float(svalue), int(svalue1));
#endif
		if (idx == IDXDomoticz)
		{
			// MAJ de l'état du radiateur
			updateFilpilote(PIN_FILPILOTE_PLUS, PIN_FILPILOTE_MOINS, int(svalue1), idx);
		}
	}
}

/**
 * MQTT reconnect
 *void reconnect()
 **/
void reconnect(const char *id, const char *topic)
{
	Serial.println(id);
	Serial.println(topic);
	Serial.println(MQTT_USER);
	Serial.println(MQTT_PASSWORD);
	Serial.println("");

	// Loop until we're reconnected
	while (!clientMQTT.connected())
	{
		Serial.print("Connexion au serveur MQTT... Status= ");
		// Attempt to connect
		// if (clientMQTT.connect("ESP53_client", "_LOGIN_", "_PASSWORD_"))
		if (clientMQTT.connect(MQTT_ID, MQTT_USER, MQTT_PASSWORD))
		// if (clientMQTT.connect(id, MQTT_USER, MQTT_PASSWORD))
		{
			Serial.println("OK");
			// suscribe to MQTT topics
			Serial.print("Subscribe to domoticz/out topic. Status= ");
			if (clientMQTT.subscribe(topic, 0))
			{
				if (clientMQTT.subscribe("#"))
				{
					Serial.println("OK");
				}
				else
				{
					Serial.print("KO, erreur: ");
					Serial.println(clientMQTT.state());
				};
			}
		}
		else
		{
			Serial.print("KO, erreur : ");
			Serial.println(clientMQTT.state());
			Serial.println(" On attend 5 secondes avant de recommencer");
			delay(5000);
		}
	}
}

/**
 * sendMqttToDomoticz
 * Mise à jour valeur domoticz par messages MQTT
 * idx -> adresse IDX domoticz du materiel
 * svalue -> donnée converti en String à envoyer
 * topic -> topic pour envoyer les message(domoticz/in)
 *
 **/
void sendMqttToDomoticz(int idx, String svalue, const char *topic)
{
	char msgToPublish[MQTT_MAX_PACKET_SIZE];

	DynamicJsonDocument doc(1024);
	doc["idx"] = idx;
	doc["nvalue"] = 0;
	doc["svalue"] = svalue;
	serializeJson(doc, msgToPublish);
	Serial.print(msgToPublish);
	Serial.print(" Published to ");
	Serial.print(topic);
	Serial.print(". Status=");
	if (clientMQTT.publish(topic, msgToPublish))
		Serial.println("OK");
	else
		Serial.println("KO");
}

/**
 * askMqttToDomoticz
 * Mise à jour valeur domoticz par messages MQTT
 * idx -> adresse IDX domoticz du materiel
 * svalue -> donnée converti en String à envoyer
 * topic -> topic pour envoyer les message(domoticz/in)
 *
 **/
void askMqttToDomoticz(int idx, String svalue, const char *topic)
{
	char msgToPublish[MQTT_MAX_PACKET_SIZE];

	DynamicJsonDocument doc(1024);
	doc["idx"] = idx;
	doc["command"] = svalue;
	serializeJson(doc, msgToPublish);
	Serial.print(msgToPublish);
	Serial.print(" Published to ");
	Serial.print(topic);
	Serial.print(". Status=");
	if (clientMQTT.publish(topic, msgToPublish))
		Serial.println("OK");
	else
		Serial.println("KO");
}
#endif

/**
 * retourSensor
 * Renvoie la température du DS18B20 en float
 *
 **/
float retourSensor(DallasTemperature sensor)
{
	// call sensors.requestTemperatures() to issue a global temperature
	// request to all devices on the bus
	// Serial.print("Requesting temperatures...");
	sensor.requestTemperatures(); // Send the command to get temperatures
	// After we got the temperatures, we can print them here.
	// We use the function ByIndex, and as an example get the temperature from the first sensor only.
	float tempC = sensor.getTempCByIndex(0);

	// Check if reading was successful
	if (tempC != DEVICE_DISCONNECTED_C)
	{
		Serial.print("Temperature mesuree: ");
		Serial.println(tempC);
	}
	else
	{
		Serial.println("Error: Pas de donnees de temperature disponible");
	}
	return tempC;
}

/**
 *  Effectue plusieurs lecture et calcule la moyenne pour pondérer la valeur obtenue.
 *
 **/
float valeurACS712(int pin)
{
	int valeur;
	float moyenne = 0;

	int nbr_lectures = 50;
	for (int i = 0; i < nbr_lectures; i++)
	{
		valeur = analogRead(pin);
		moyenne = moyenne + float(valeur);
	}
	moyenne = moyenne / float(nbr_lectures);
	Serial.print("Entree ADC: ");
	Serial.println(String(moyenne));

	float amplitude_courant = abs(40 * ((float)moyenne / 1024) - 20);

	Serial.print("\n Courant = ");
	Serial.print(amplitude_courant, 2);
	Serial.println("A");

	return amplitude_courant;
}

/**
 *  MAJ des sorties fil pilote en fonction du message Domoticz
 *
 **/
void updateFilpilote(int pinPlus, int pinMoins, int svalue, int idx)
{
	String message;

	Serial.println(F("Mise a jour fil Pilote depuis DOMOTICZ: "));
	Serial.print("Nombre de Timer disponibles: ");
	Serial.println(ISR_Timer.getNumAvailableTimers());
	ISR_Timer.disableAll();

	for (size_t i = 0; i < ISR_Timer.getNumAvailableTimers(); i++)
	{
		Serial.println(i);
		Serial.print("Numéro Timer: ");
		Serial.println(ISR_Timer.getNumTimers());
		if (ISR_Timer.getNumTimers() != -1)
		{
			ISR_Timer.deleteTimer(i);
		}
	}

