Fredoun21/ESP8266_Domoticz_Radiateur_MQTT_WM/src/main.cpp
	// Serial.print("Numéro Timer disponible: ");
	// Serial.println(ISR_Timer.);
	// Serial.print("Numéro Timer disponible: ");
	// Serial.println(ISR_Timer.getNumAvailableTimers());
	// Serial.print("Numéro Timer disponible: ");
	// Serial.println(ISR_Timer.getNumAvailableTimers());

	// Etat de 00 à 10: Radiateur sur Arrêt
	// Etat de 11 à 20: Radiateur sur Hors Gel
	// Etat de 21 à 30: Radiateur sur ECO
	// Etat de 31 à 40: Radiateur sur Confort 2 (T° Confort - 2°C)
	// Etat de 41 à 50: Radiateur sur Confort 1 (T° Confort - 1°C)
	// Etat de 51 à 100: Radiateur sur Confort

	if (0 <= svalue && svalue < 10)
	{
		digitalWrite(pinPlus, HIGH);
		digitalWrite(pinMoins, LOW);
#ifndef ISR_TIMER
		confortStopTask();
#endif
		Serial.println(F("Radiateur sur Arret"));
		message = "Pin ";
		message += String(pinPlus);
		message += " = HIGH / Pin  ";
		message += String(pinMoins);
		message += " = LOW";
		Serial.println(message);
	}
	else if (10 <= svalue && svalue < 20)
	{
		digitalWrite(pinPlus, LOW);
		digitalWrite(pinMoins, HIGH);
#ifndef ISR_TIMER
		confortStopTask();
#endif
		Serial.println(F("Radiateur sur Hors gel"));
		message = "Pin ";
		message += String(pinPlus);
		message += " = LOW / Pin ";
		message += String(pinMoins);
		message += " = HIGH";
		Serial.println(message);
	}
	else if (20 <= svalue && svalue < 30)
	{
		digitalWrite(pinPlus, HIGH);
		digitalWrite(pinMoins, HIGH);
#ifndef ISR_TIMER
		confortStopTask();
#endif
		Serial.println(F("Radiateur sur ECO"));
		message = "Pin ";
		message += String(pinPlus);
		message += " = HIGH / Pin ";
		message += String(pinMoins);
		message += " = HIGH";
		Serial.println(message);
	}
	else if (30 <= svalue && svalue < 40)
	{
#ifndef ISR_TIMER
		confortSetPin(pinPlus, pinMoins, 7, 293);
#endif
#ifdef ISR_TIMER
		ISR_Timer.setInterval(7000L, doingSomethingConfort2);
#endif
		Serial.println(F("Radiateur sur Confort 2"));
		// Absence de courant pendant 293s, puis présence pendant 7s
	}
	else if (40 <= svalue && svalue < 50)
	{
#ifndef ISR_TIMER
		confortStopTask();
		confortSetPin(pinPlus, pinMoins, 3, 297);
#endif
#ifdef ISR_TIMER
		ISR_Timer.setInterval(3000L, doingSomethingConfort1);
#endif
		Serial.println(F("Radiateur sur Confort 1"));
		// Absence de courant pendant 297s, puis présence pendant 3s
	}
	else if (50 <= svalue && svalue <= 100)
	{
		digitalWrite(pinPlus, LOW);
		digitalWrite(pinMoins, LOW);
#ifndef ISR_TIMER
		confortStopTask();
#endif
		Serial.println(F("Radiateur sur Confort"));
		message = "Pin ";
		message += String(pinPlus);
		message += " = LOW / Pin ";
		message += String(pinMoins);
		message += " = LOW";
		Serial.println(message);
	}
	else
	{
		Serial.println(F("Fil pilote: Mauvaise valeur!"));
	}
}

/**
 *  Procédure MAJ sortie pour mode confort 1 & 2
 *
 **/
void setPinConfort(int state)
{
	digitalWrite(PIN_FILPILOTE_PLUS, state);
	digitalWrite(PIN_FILPILOTE_MOINS, state);
	// i++;
	//  Serial.print(F("Compteur: ")); Serial.println(i);
	//  Serial.print(F("STATE: ")); Serial.println(state);

	if (state == 1)
	{
		Serial.println(F("Tempo HIGH"));
	}
	else if (state == 0)
	{
		Serial.println(F("Tempo LOW"));
	}
}

/**
 *  Lancement tempo pour mode confort 1 & 2
 *
 **/

void confortSetPin(int aPinHigh, int aPinLow, float aTempoHigh, float aTempoLow)
{
#ifndef ISR_TIMER
	tickerSetHigh.attach(aTempoHigh, setPinConfort, 1);
	tickerSetLow.attach(aTempoLow, setPinConfort, 0);
#endif

#ifdef ISR_TIMER
	ISR_Timer.changeInterval(0, aTempoHigh);
	ISR_Timer.changeInterval(0, aTempoLow - aTempoHigh);
#endif
}

/**
 * Arrêt tempo pour mode confort 1 & 2
 *
 **/
#ifndef ISR_TIMER
void confortStopTask()
{
	tickerSetHigh.detach();
	tickerSetLow.detach();
}
#endif

/**
 * Déclenchement des timers
 *
 **/
#ifdef ISR_TIMER
void IRAM_ATTR TimerHandler()
{
	static bool toggle = false;
	static bool started = false;
	static int timeRun = 0;

	ISR_Timer.run();

	// Toggle LED every LED_TOGGLE_INTERVAL_MS = 2000ms = 2s
	if (++timeRun == (LED_TOGGLE_INTERVAL_MS / HW_TIMER_INTERVAL_MS))
	{
		timeRun = 0;

		if (!started)
		{
			started = true;
			pinMode(LED_BUILTIN, OUTPUT);
		}

		// timer interrupt toggles pin LED_BUILTIN
		digitalWrite(LED_BUILTIN, toggle);
		toggle = !toggle;
	}
}
#endif

/**
 * affiche la valeur des timer pour mode confort 1 & 2
 *
 **/
#ifdef ISR_TIMER
#if (TIMER_INTERRUPT_DEBUG > 0)
void printStatus(uint16_t index, unsigned long timerDelay, unsigned long deltaMillis, unsigned long currentMillis)
{
	Serial.print(timerDelay / 1000);
	Serial.print("s: Delta ms = ");
	Serial.print(deltaMillis);
	Serial.print(", ms = ");
	Serial.println(currentMillis);
}
#endif
#endif

/*
 *Sous programme d'interruption du timer 1
 *
 */
#ifdef ISR_TIMER
void doingSomethingConfort1()
{
#if (TIMER_INTERRUPT_DEBUG > 0)
	static unsigned long previousMillis = startMillis;

	unsigned long currentMillis = millis();
	unsigned long deltaMillis = currentMillis - previousMillis;

#endif
	static bool toggle = false;
	Serial.print("Numéro Timer: ");
	Serial.println(ISR_Timer.getNumTimers());
	if (toggle)
	{
		printStatus(0, TIMER_INTERVAL_300S - TIMER_INTERVAL_3S, deltaMillis, currentMillis);
		ISR_Timer.changeInterval(0, TIMER_INTERVAL_3S);
	}
	else
	{
		printStatus(0, TIMER_INTERVAL_3S, deltaMillis, currentMillis);
		ISR_Timer.changeInterval(0, (TIMER_INTERVAL_300S - TIMER_INTERVAL_3S));
	}

	previousMillis = currentMillis;
	toggle = !toggle;
}
void doingSomethingConfort2()
{
#if (TIMER_INTERRUPT_DEBUG > 0)
	static unsigned long previousMillis = startMillis;

	unsigned long currentMillis = millis();
	unsigned long deltaMillis = currentMillis - previousMillis;

#endif
	static bool toggle = false;
	Serial.print("Numéro Timer: ");
	Serial.println(ISR_Timer.getNumTimers());
	if (toggle)
	{
		printStatus(0, TIMER_INTERVAL_300S - TIMER_INTERVAL_7S, deltaMillis, currentMillis);
		ISR_Timer.changeInterval(0, TIMER_INTERVAL_7S);
	}
	else
	{
		printStatus(0, TIMER_INTERVAL_7S, deltaMillis, currentMillis);
		ISR_Timer.changeInterval(0, (TIMER_INTERVAL_300S - TIMER_INTERVAL_7S));
	}

	previousMillis = currentMillis;
	toggle = !toggle;
}
#endif

/**
 *
 *
 **/
#ifdef OTA
void onOTAStart()
{
	// Log when OTA has started
	Serial.println("OTA update started!");
	// <Add your own code here>
}

/**
 *
 *
 **/
void onOTAProgress(size_t current, size_t final)
{
	// Log every 1 second
	if (millis() - ota_progress_millis > 1000)
	{
		ota_progress_millis = millis();
		Serial.printf("OTA Progress Current: %u bytes, Final: %u bytes\n", current, final);
	}
}

/**
 *
 *
 **/
void onOTAEnd(bool success)
{
	// Log when OTA has finished
	if (success)
	{
		Serial.println("OTA update finished successfully!");
	}
	else
	{
		Serial.println("There was an error during OTA update!");
	}
	// <Add your own code here>
}
#endif
